Revit 2027 API
SolidOrShellTessellationControls.Accuracy Property
 A positive real number specifying how accurately a triangulation should approximate a solid or shell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Accuracy { get; set; }
Public Property Accuracy As Double
	Get
	Set
public:
property double Accuracy {
	double get ();
	void set (double value);
}
member Accuracy : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for accuracy must be greater than 0 and no more than 30000 feet.
Remarks
 The maximum distance from a point on the triangulation to the nearest point on the solid or shell should be no greater than the specified accuracy. This constraint may be approximately enforced.
See Also
Reference
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace